<p>Bem vindo ao Manual de Utilizador do BaShip, aqui encontrar&aacute; os passos detalhados de todas as funcionalidades do jogo com imagens ilustrativas.</p>
<p><strong>Indice:</strong></p>
<ol>
<li><strong><em><a href="#Login,Registo e Defini&ccedil;&otilde;es">Login,Registo e Defini&ccedil;&otilde;es</a></em></strong></li>
<li><strong><em><a href="#Lobby">Lobby</a></em></strong>
<ol>
<li><strong><em> <a href="#Players">Players</a></em></strong></li>
<li><strong><em><a href="#Games">Games</a></em></strong></li>
<li><strong><em><a href="#Global Chat">Global Chat</a></em></strong></li>
</ol>
</li>
<li><strong><a href="#Game e Private Chat">Game e Private Chat</a></strong></li>
</ol>
<h1><strong><em><a id="Login,Registo e Defini&ccedil;&otilde;es"></a>1. Login</em>, Registo e Defini&ccedil;&otilde;es</strong></h1>
<p><img src="1_int.jpeg"/></p>
<p>Para realizar o registo/login &eacute; necess&aacute;rio preencher, em ambos os casos, o campo <strong>1</strong> com o nome de utilizador desejado e de seguida o campo <strong>2</strong> com a palavra passe desejada, constitu&iacute;da obrigatoriamente por letras e n&uacute;meros, com tamanho m&iacute;nimo de 6 caracteres.</p>
<p>Caso j&aacute; tenha efetuado um registo anteriormente, ap&oacute;s preencher os campos <strong>1</strong> e <strong>2, </strong>apenas ter&aacute; de clicar no bot&atilde;o indicado com o n&uacute;mero <strong>4</strong>, &ldquo;<em>Login</em>&rdquo;.</p>
<p>Caso seja a primeira utiliza&ccedil;&atilde;o ser&aacute; necess&aacute;rio, em primeiro lugar, efectuar o registo. Para isso, ap&oacute;s preencher os campos <strong>1</strong> e <strong>2</strong>, ter&aacute; de clicar no bot&atilde;o indicado com o n&uacute;mero <strong>3</strong>, &ldquo;<em>Register</em>&rdquo;, e de seguida reescrever a palavra passe na nova janela no campo indicado com o n&uacute;mero <strong>6</strong>.</p>
<p><img src="2_int.jpeg"/></p>
<p>De seguida, ap&oacute;s clicar no bot&atilde;o indicado com o n&uacute;mero <strong>7</strong>, caso as palavras passe coincidam, o login ser&aacute; automaticamente efetuado, caso contr&aacute;rio, ter&aacute; de reescrever a palavras passe no campo indicado com o n&uacute;mero <strong>6</strong>.</p>
<p><br />Para aceder &agrave;s Defini&ccedil;&otilde;es do jogo basta clicar no bot&atilde;o indicado com o n&uacute;mero 5, que abrir&aacute; a interface apresentada na imagem a seguir.</p>
<p><img src="3_int.jpeg"/></p>
<p>Nesta interface pode Ligar/Desligar os efeitos sonoros do jogo ao clicar na caixa de &ldquo;sound&rdquo; indicada com o n&uacute;mero <strong>8</strong> . Na caixa &ldquo;Dark theme&rdquo; indicada com o n&uacute;mero <strong>9</strong> poder&aacute; alterar o aspeto do jogo entre um tema escuro ou claro.</p>
<p>Para mudar o servidor ao qual est&aacute; conectado, basta introduzir na caixa de texto com o n&uacute;mero <strong>10 </strong>&nbsp;o nome do servidor, e na caixa de texto n&uacute;mero <strong>11</strong> o n&uacute;mero da porta.</p>
<p>O bot&atilde;o 12 testa a liga&ccedil;&atilde;o ao servidor, para saber se esta est&aacute; correta, e v&aacute;lida. E finalmente, para gravar as altera&ccedil;&otilde;es submetidas nas defini&ccedil;&otilde;es basta clicar no bot&atilde;o n&uacute;mero 13. Para regressar &agrave; interface anterior basta clicar no bot&atilde;o n&uacute;mero 14.</p>
<p>&nbsp;</p>
<h1><strong><em><a id="Lobby"></a>2. Lobby</em></strong></h1>
<h2><strong><em><a id="Players"></a>a. Players</em></strong></h2>
<p><img src="4_int.jpeg"/></p>
<p>Nesta interface poder&aacute; consultar uma lista de todos os jogadores registados no servidor, as suas estat&iacute;sticas de jogo e se est&atilde;o <em>online,</em> <em>offline</em> ou a jogar. Pode atualizar esta lista clicando no bot&atilde;o n&uacute;mero <strong>15</strong>.</p>
<p>Poder&aacute; iniciar um jogo com um oponente aleat&oacute;rio que esteja ligado ao servidor ao clicar no bot&atilde;o n&uacute;mero <strong>16.</strong></p>
<p><em>Poder&aacute; tamb&eacute;m iniciar um jogo com um dos jogadores que est&atilde;o online clicando duas vezes no nome do advers&aacute;rio pretendido para o desafio, ou ser convidado por outro jogador.</em></p>
<p><img src="5_int.jpeg"/></p>
<p>Caso queira passar para outra p&aacute;gina com da lista apresentada poder&aacute; faz&ecirc;-lo clicando nas caixas com os n&uacute;meros <strong>17</strong> e <strong>18</strong>, caso queira ir para uma p&aacute;gina a frente ou atr&aacute;s, respectivamente.</p>
<p>Clicando na barra de texto indicada com o n&uacute;mero <strong>19</strong> poder&aacute; filtrar os jogadores que se encontram na lista, escrevendo o nome do jogador em causa na caixa de texto e de seguida clicar no bot&atilde;o <strong>20. </strong>Caso queira cancelar a pesquisa poder&aacute; clicar no bot&atilde;o indicado com o n&uacute;mero <strong>21.</strong></p>
<p>Caso queira alternar para outra das janelas dispon&iacute;veis, Games e Global Chat, poder&aacute; faz&ecirc;-lo clicando nos bot&otilde;es <strong>22</strong> ou <strong>23</strong>, respectivamente.</p>
<p><em>Se a qualquer momento quiser abandonar o jogo poder&aacute; faz&ecirc;-lo clicando no bot&atilde;o <em>Logout</em> indicado com o n&uacute;mero 24.</em></p>
<h2><strong><em><a id="Games"></a>b. Games</em></strong></h2>
<p><img src="6_int.jpeg"/></p>
<p>A principal diferen&ccedil;a nesta interface &eacute; a exist&ecirc;ncia do bot&atilde;o <strong>25</strong> que permite ao utilizador filtrar o tipo de jogos que quer ver: todos os jogos anteriormente inicializados ou apenas aqueles que est&atilde;o a ser disputados no momento.</p>
<p>Caso o utilizador pretenda fazer <em>espectate </em>a um jogo precisar&aacute; apenas de clicar duas vezes em cima do jogo que est&aacute; a decorrer.</p>
<p>Os bot&otilde;es com os n&uacute;meros <strong>15</strong>,<strong>16</strong>,<strong>17</strong>,<strong>18</strong>,<strong>19</strong>,<strong>20</strong>,<strong>21 </strong>e <strong>24</strong> tamb&eacute;m presentes na interface anterior (<em>lobby_players</em>) encontram-se tamb&eacute;m funcionais nesta interface.</p>
<p>Caso o utilizador pretenda alternar para outra das janelas dispon&iacute;veis, Players e Global Chat, poder&aacute; faz&ecirc;-lo clicando nos bot&otilde;es <strong>26</strong> ou <strong>27</strong>, respectivamente.</p>
<h2><strong><em><a id="Global Chat"></a>c. Global Chat</em></strong></h2>
<p><img src="7_int.jpeg"/></p>
<p>Nesta interface o utilizador poder&aacute; comunicar com qualquer outro jogador que se encontre <em>online.</em> Poder&aacute; faz&ecirc;-lo escrevendo a mensagem em causa na caixa de texto com o n&uacute;mero <strong>28</strong> e, de seguida, clicando no bot&atilde;o n&uacute;mero <strong>29</strong> o utilizador poder&aacute; finalizar o envio da mesma.</p>
<p>Os bot&otilde;es com os n&uacute;meros <strong>15,16,20</strong> tamb&eacute;m presentes nas interfaces anteriores (<em>lobby_players</em> e<em> lobby_games</em>) encontram-se tamb&eacute;m funcionais nesta interface.</p>
<p>O utilizador poder&aacute; sempre alterar a janela em que se encontra, escolhendo a qual das restantes pretende aceder, clicando nos bot&otilde;es <strong>30 </strong>ou <strong>31</strong>, que corresponde a Players e Games respetivamente.</p>
<h1><br /><strong><a id="Game e Private Chat"></a>3. Game e Private Chat</strong></h1>
<p>A primeira coisa a fazer nesta &eacute; interface &eacute; colocar os navios no pr&oacute;prio mapa, indicado com o n&uacute;mero <strong>32</strong>, para tal, o utilizador tem de clicar em cada posi&ccedil;&atilde;o pretendida at&eacute; obter todas as combina&ccedil;&otilde;es necess&aacute;rias (1 navio de tamanho 4, 2 navios de tamanho 3, 3 navios de tamanho 2 e, por fim, 4 navios de tamanho 1).</p>
<p>De seguida, caso o oponente j&aacute; esteja pronto para jogar, o utilizador pode clicar no bot&atilde;o 33 para dar in&iacute;cio ao jogo.</p>
<p><img src="8_int.jpeg"/></p>
<p>Caso seja a sua vez de jogar, poder&aacute; tentar adivinhar a localiza&ccedil;&atilde;o dos navios do oponente, clicando uma vez numa das posi&ccedil;&otilde;es do mapa indicado com o n&uacute;mero <strong>34.</strong></p>
<p>Caso o utilizador pretenda pode comunicar com o seu oponente poder&aacute; faz&ecirc;-lo escrevendo a mensagem em causa na caixa de texto com o n&uacute;mero <strong>35</strong> e, de seguida, clicando no bot&atilde;o n&uacute;mero <strong>36</strong> o utilizador poder&aacute; finalizar o envio da mesma ou ent&atilde;o, necessita apenas de pressionar a tecla <em>enter</em>.</p>
<p><img src="9_int.jpeg"/></p>
<p>&nbsp;<strong>No caso de o utilizador pretender abandonar o jogo em curso poder&aacute; faz&ecirc;-lo utilizando para tal o bot&atilde;o com o n&uacute;mero 37.</strong></p>
<p><img src="10_int.jpeg"/></p>
<p>No final do jogo, caso este chegue ao fim, aparecer&aacute; uma janela nova que indicar&aacute; se o jogador foi o vencedor ou se este perdeu o jogo. Clicando de seguida no bot&atilde;o com o n&uacute;mero <strong>38, </strong>o jogador voltar&aacute; novamente ao <em>Lobby.</em></p>
<p><img src="11_int.jpeg"/></p>
<p><em>Depois destes passos todos, est&aacute; pronto para conseguir percorrer todas as interfaces do jogo, com confian&ccedil;a para desafiar o oponente e ganhar o jogo!</em></p>